/*
 库的概念
● 库是一个二进制文件，包含的代码可被程序调用
● 常见的库包括，标准C库、数学库、线程库......
● 库有源码，可下载后编译生成；也可直接安装二进制包
● 系统安装的库放在 /lib  /usr/lib
● 库是实现编译好的，可以复用的代码。
● 在OS上运行的程序基本上都要使用库。使用库可以提高开发效率。
● Windows和Linux下库文件的格式不兼容
● Linux下包含静态库和共享库
静态库
静态库的特点
● 编译(链接)时把静态库中相关代码复制到可执行文件中
  ○ 程序用到库的哪些公共，就包含哪些代码，而不是全部包含。
  ○ 程序中已包含代码，运行时不再需要静态库。
  ○ 程序运行时无需加载库，运行速度更快。
  ○ 因为静态库中的代码被复制到程序中，导致占用更多磁盘和内存空间。
  ○ 静态库升级后，程序需要重新编译链接
 */

/*
 *主要是static的静态库命令
cd static
gcc -Wall -c hello.c -o hello.o
ar rcs libhello.a hello.o
nm libhello.a
gcc -Wall main.c -o main -L. -lhello

 *
 */
